SKILL_DB = {
    'single': {
        'text': '敵単体に%.1f倍のダメージを与える'
    }, 
    'single_affection': {
        'text': '現在好感度に応じ敵単体に%.1f～%.1f倍のダメージを与える'
    }, 
    'vampire': {
        'text': '敵単体に%.1f倍のダメージを与え、HPを吸収する'
    }, 
    'tristrike': {
        'text': '敵に3回%.1f倍のダメージを与える'
    }, 
    'tristrike_n_all': {
        'text': '敵に3回%.1f倍ダメージを与えた後、敵全体に%.1f倍のダメージを与える'
    }, 
    'double': {
        'text': '敵2体に%.1f倍のダメージを与える'
    }, 
    'smart': {
        'text': '敵全体に、敵が残り1体の場合%.1f倍、2体の場合%.1f倍、3体の場合%.1f倍のダメージを与える'
    }, 
    'all': {
        'text': '敵全体に%.1f倍のダメージを与える'
    }
}